html/20231126T005411--org-clock-report__emacs.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-16 Sat 18:03 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>org clock report</title>
<meta name="author" content="Arvydas G." />
<meta name="description" content="welcome to my site" />
<meta name="keywords" content="emacs antanas geles" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../static/style.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="sitemap.html"> HOME </a>
</div><div id="preamble" class="status">
<div id="created">Page creation date(kodel 3
	 skirtingos datos???): 2023-12-14 Thu 16:09</div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">org clock report</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org544f1f1">1. examples</a></li>
</ul>
</div>
</nav>
<p>
Was useful in obelsdumas times when I wanted to track how much time I used on
building and working on the project. Padaryti isklotines su laiku kiek dirbau
prie ko ir pan.
</p>

<p>
Link to the docs - <a href="https://orgmode.org/manual/The-clock-table.html">https://orgmode.org/manual/The-clock-table.html</a>
</p>

<div id="outline-container-org544f1f1" class="outline-2">
<h2 id="org544f1f1"><span class="section-number-2">1.</span> <a href="#org544f1f1">examples</a></h2>
<div class="outline-text-2" id="text-1">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2022-04-10 Sun] </span></span> Daily org-diary file report BY TAG
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">#+BEGIN: clocktable :maxlevel 3 :scope file :tags t :sort (1 . ?a) :emphasize t :narrow 100! :match "emacs"
</pre>
</div>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2022-04-10 Sun] </span></span> Daily org-diary file report without tag, show all tasks
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">#+BEGIN: clocktable :maxlevel 3 :scope file :tags t :sort (1 . ?a) :emphasize t :narrow 100!
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arvydas G. (<a href="mailto:arvydas.gaspa@gmail.com">arvydas.gaspa@gmail.com</a>)</p>
<p class="date">Date: 2023-11-26 Sun 00:54</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
<p class="validation"></p>
</div>
<script>window.klipse_settings = {selector_eval_html: '.src-html',
                             selector_eval_js: '.src-js',
                             selector_eval_python_client: '.src-python',
                             selector_eval_scheme: '.src-scheme',
                             selector: '.src-clojure',
                             selector_eval_ruby: '.src-ruby'};</script><script src="https://storage.googleapis.com/app.klipse.tech/plugin_prod/js/klipse_plugin.min.js"></script><link rel="stylesheet" type="text/css" href="https://storage.googleapis.com/app.klipse.tech/css/codemirror.css"/></body>
</html>